[
    {
        "title": "Deactivate ActiveX",
        "priority": "recommended",
        "description": "<a href=\"https://en.wikipedia.org/wiki/ActiveX\">ActiveX</a> is barley used nowadays, but Microsoft  browsers have it enabled by default. It acts as a middleware between Java and Flash applications and your PC. But it is commonly used for malicious sites to run scripts directly on your PC. See <a href=\"https://www.howtogeek.com/162282/what-activex-controls-are-and-why-theyre-dangerous/\">this article</a> for more details"
    },
    {
        "title": "Disable Flash",
        "priority": "recommended",
        "description": "Adobe Flash has been around since the dawn of the internet, however it has been falling in popularity for a while. It brings with it many unpatched vulnerabilities (a few of which you can <a href=\"https://www.comparitech.com/blog/information-security/flash-vulnerabilities-security/\">read about here</a>). See <a href=\"https://www.howtogeek.com/222275/how-to-uninstall-and-disable-flash-in-every-web-browser/\">this guide</a>, on how to disable Flash player, or <a href=\"https://www.tomsguide.com/us/disable-flash-how-to,news-21335.html\">this guide for more details on how dangerous it can be</a>"
    },
    {
        "title": "Block Trackers",
        "priority": "recommended",
        "description": "Consider installing a browser extension, such as <a href=\"https://www.eff.org/privacybadger\">Privacy Badger</a>, to stop advertisers from secretly tracking you"
    },
    {
        "title": "Block scripts from bad origin",
        "priority": "recommended",
        "description": "Use an extension such as <a href=\"https://github.com/gorhill/uBlock\">uBlock Origin</a>, to block anything being loaded from an external or unverified origin"
    },
    {
        "title": "Force HTTPS only traffic",
        "priority": "recommended",
        "description": "Ensure that you only use websites through https. It’s recommended to use an extension such as <a href=\"https://www.eff.org/https-everywhere\">HTTPS Everywhere</a>, to force all sites to load securely"
    },
    {
        "title": "Only use trusted browser addons and extensions",
        "priority": "recommended",
        "description": "Both Firefox and Chrome webstore allow you to check what permissions access rights an extension requires before you install it. Check the reviews. Only install extensions you really need."
    },
    {
        "title": "Always keep your browser up-to-date",
        "priority": "recommended",
        "description": "Browser vulnerabilities are constantly being discovered and patched, so it’s important to keep it up to date, to avoid a zero-day exploit"
    },
    {
        "title": "Use a private search engine",
        "priority": "optional",
        "description": "Take a look at <a href=\"https://duckduckgo.com\">DuckDuckGo</a> or <a href=\"https://www.startpage.com\">StartPage</a>. Neither store cookies or cache anything"
    },
    {
        "title": "Consider a privacy browser",
        "priority": "optional",
        "description": "Google openly collects usage data on Chrome usage. There are several privacy browsers out there which minimise the amount of data collected. Have a look at <a href=\"https://brave.com\">Brave Browser</a>, <a href=\"https://browser.yandex.com\">Yandex</a>, or <a href=\"https://www.comodo.com/home/browsers-toolbars/browser.php\">Comodo</a>. As a more extreme choice, consider <a href=\"https://www.torproject.org/\">Tor</a>"
    },
    {
        "title": "Disable JavaScript",
        "priority": "advanced",
        "description": "Many modern web apps, are JavaScript based, so disabling it will greatly reduce your browsing experience. But if you really want to go all out, then it will reduce your attack surface. Read more about the growing <a href=\"https://heimdalsecurity.com/blog/javascript-malware-explained/\">risk of JavaScript malware</a>"
    }
]