[
    {
        "title": "Use a strong password",
        "priority": "recommended",
        "description": "Check how strong your password is at: <a href=\"https://howsecureismypassword.net\">HowSecureIsMyPassword.net</a>. Try to get a got mixture of upper and lower-case letters, numbers and symbols. Avoid names, places and dictionary words where possible, and aim to get a decent length. Have a look at <a href=\"https://www.betterbuys.com/estimating-password-cracking-times/\">How Long will it take to Crack my Password</a>."
    },
    {
        "title": "Don’t save your password in browsers",
        "priority": "recommended",
        "description": "Most modern browsers offer to save your credentials when you log into a site. Don’t allow this! As they are not encrypted, hence can allow easy access into your accounts. Also do not store passwords in a .txt file or any other unencrypted means. Ideally use a password manager."
    },
    {
        "title": "Use different passwords for each account you have",
        "priority": "recommended",
        "description": "If one password gets compromised, it can give hackers access to your other online sites, so it is highly recommended not to reuse the same passwords. In order to manage having hundreds of different passwords, use a <a href=\"https://en.wikipedia.org/wiki/Password_manager\">password manager</a>. Have a look at <a href=\"https://www.lastpass.com\">LastPass</a>, <a href=\"https://www.dashlane.com\">DashLane</a>, <a href=\"https://keepass.info\">KeePass</a> or <a href=\"https://www.roboform.com\">Robo Forms 8</a>."
    },
    {
        "title": "Be cautious when logging in on someone elses device",
        "priority": "recommended",
        "description": "Ideally you wouldn’t ever log into any of your services on someone else’s device, since you can’t be sure that they don’t have any malware. If you do, ensure that your in a private session (like Incognito mode) so that nothing gets saved"
    },
    {
        "title": "Avoid password hints",
        "priority": "optional",
        "description": "It is likely that there is a lot of information about you online, so it can be an easy task for a hacker to find out which high school you went to, or what your Mums name is."
    },
    {
        "title": "Never answer online security questions truthaly",
        "priority": "optional",
        "description": "Instead, create a password inside your password manager to store your fictitious answer. This will stop people guessing your place of birth or mothers mainen name."
    },
    {
        "title": "Don’t use a 4-digit pin to access your phone",
        "priority": "optional",
        "description": "Don’t use a short pin to access your smartphone or computer. Instead use a text password."
    },
    {
        "title": "Use an offline password manager",
        "priority": "advanced",
        "description": "Consider an offline password manager, encrypted by a strong password. If you work across two or more computers, this could be stored on an encrypted USB. <a href=\"http://keepass.info/\">KeePass</a> is a strong choice "
    },
    {
        "title": "If possible, try to avoid bio-metric and hardware-based authentication",
        "priority": "advanced",
        "description": "Fingerprint sensors, face-detection and voice-recognition are all easily hackable. Where possible replace these with traditional passwords."
    },
    {
        "title": "Password protect your BIOS and drives",
        "priority": "advanced",
        "description": "A BIOS or UEFI password helps to make an inexperienced hackers life a bit harder if they get hold of your PC or hard drive, <a href=\"https://www.howtogeek.com/186235/how-to-secure-your-computer-with-a-bios-or-uefi-password/\">here is a guide on how to do it</a>"
    }
]